#+title: Problem Set 2
#+author: Erik An
#+email: obluda2173@gmail.com
#+date: <2025-10-06>
#+lastmod: <2025-10-10 08:36>
#+options: num:t
#+startup: overview

*** Solution
- Names: Kevin, Heather, Randy, Vijay, Abbey

#+begin_src julia :session none :results value
# s - statement
s1(K,H) = K || H
s2(R,V) = xor(R,V)
s3(A,R) = !A || R
s4(K,V) = K == V
s5(H,A,K) = !H || (A && K)

function validation(chat_list::Vector{Bool})
    K = chat_list[1]
    H = chat_list[2]
    R = chat_list[3]
    V = chat_list[4]
    A = chat_list[5]

    if s1(K, H) && s2(R, V) && s3(A, R) && s4(K, V) && s5(H, A, K)
        return true
    end

    return false
end

function get_chats()
    n = 5
    result = Vector{Vector{Bool}}()

    for mask in 0:(1 << n) - 1
        combination = Vector{Bool}()

        for j in 1:n
            if ((mask >> (j - 1)) & 1) == 1
                push!(combination, true)
            else
                push!(combination, false)
            end
        end
        if validation(combination)
            push!(result, combination)
        end
    end
    return result
end

get_chats()

#+end_src

#+RESULTS:
: Bool[1, 0, 0, 1, 0]

*** Solution
#+begin_src julia :session none :results output
using TruthTables
@truthtable P || Q && (P --> R) --> (P --> ((Q && P) || R))
#+end_src

#+RESULTS:
#+begin_example
TruthTable
┌───────┬───────┬───────┬─────────────────────────────────────────┐
│   P   │   Q   │   R   │ P ∨ Q ∧ (P --> R) --> (P --> Q ∧ P ∨ R) │
├───────┼───────┼───────┼─────────────────────────────────────────┤
│ true  │ true  │ true  │ true                                    │
│ true  │ true  │ false │ true                                    │
│ true  │ false │ true  │ true                                    │
│ true  │ false │ false │ false                                   │
│ false │ true  │ true  │ true                                    │
│ false │ true  │ false │ true                                    │
│ false │ false │ true  │ true                                    │
│ false │ false │ false │ true                                    │
└───────┴───────┴───────┴─────────────────────────────────────────┘
#+end_example
